apex-log-mode.org

* LOG MODE
#+begin_src emacs-lisp :tangle apex-log-mode.el
(defface salesforce-details-log-face '((t :foreground "#2D4356"))
  "Face for detail in log file"
  :group 'salesforce-log)

(defface salesforce-groverment-log-face '((t :foreground "#6DA9E4"))
  "Face for groverment in log file"
  :group 'salesforce-log)

(defface salesforce-execute-log-face '((t :foreground "#6C9BCF"))
  "Face for execute in log file"
  :group 'salesforce-log)

(defface salesforce-run-mode-face '((t :foreground "#576CBC"))
  "Face for running mode in log file"
  :group 'salesforce-log)

(defface salesforce-log-text-face '((t :foreground "#EEEEEE"))
  "Face for running mode in log file"
  :group 'salesforce-log)

(defface salesforce-log-line-face '((t :foreground "#2DCDDF"))
  "Face for line code in log file"
  :group 'salesforce-log)

(defface salesforce-log-timestamp-face '((t :foreground "#4D4D4D"))
  "Face for timestamp in log file"
  :group 'salesforce-log)

(defface salesforce-groverment-value-face '((t :foreground "#6C9BCF"))
  "Face for groverment value in log file"
  :group 'salesforce-log)

(defface salesforce-groverment-limit-face '((t :foreground "#D21312"))
  "Face for groverment limit in log file"
  :group 'salesforce-log)

(defcustom salesforce-function-event-keywords '("SYSTEM_METHOD_EXIT"
                                                "SYSTEM_METHOD_ENTRY"
                                                "METHOD_ENTRY"
                                                "METHOD_EXIT")
  ""
  :type 'list
  :group 'salesforce-log)

(defcustom salesforce-groverment-event-keywords '("HEAP_ALLOCATE"
                                                  "LIMIT_USAGE_FOR_NS"
                                                  "Number of SOQL queries"
                                                  "Number of query rows"
                                                  "Number of SOSL queries"
                                                  "Number of DML statements"
                                                  "Number of Publish Immediate DML"
                                                  "Number of DML rows"
                                                  "Maximum CPU time"
                                                  "Maximum heap size"
                                                  "Number of callouts"
                                                  "Number of Email Invocations"
                                                  "Number of future calls"
                                                  "Number of queueable jobs added to the queue"
                                                  "Number of Mobile Apex push calls"
                                                  "CUMULATIVE_LIMIT_USAGE"
                                                  "CUMULATIVE_LIMIT_USAGE_END")
  ""
  :type 'list
  :group 'salesforce-log)

(defcustom salesforce-execute-event-keywords '("STATEMENT_EXECUTE"
                                               "CODE_UNIT_STARTED"
                                               "CODE_UNIT_FINISHED"
                                               "EXECUTION_STARTED"
                                               "EXECUTION_FINISHED")
  ""
  :type 'list
  :group 'salesforce-log)

(defcustom salesforce-mode-event-keywords '("SYSTEM_MODE_ENTER"
                                            "SYSTEM_MODE_EXIT")
  ""
  :type 'list
  :group 'salesforce-log)

(defcustom log-details-keywords-regex "\\(\\s\\S\\)"
  ""
  :group 'salesforce-log)

(setq salesforce-font-lock
      (let ((salesforce-function-event-keywords-regex (regexp-opt salesforce-function-event-keywords 'word))
            (salesforce-groverment-event-keywords-regex (regexp-opt salesforce-groverment-event-keywords 'word))
            (salesforce-execute-event-keywords-regex (regexp-opt salesforce-execute-event-keywords 'word))
            (salesforce-mode-event-keywords-regex (regexp-opt salesforce-mode-event-keywords 'word)))

        `((,salesforce-groverment-event-keywords-regex . 'salesforce-groverment-log-face)
          (,salesforce-execute-event-keywords-regex . 'salesforce-execute-log-face)
          (,salesforce-function-event-keywords-regex . 'font-lock-function-name-face)
          (,salesforce-mode-event-keywords-regex . 'salesforce-run-mode-face)
          ("\\([0-9]+\\) out of \\([0-9]+\\)" . ((1 'salesforce-groverment-value-face) (2 'salesforce-groverment-limit-face)))
          ("[0-9]\\{0,2\\}:[0-9]\\{0,2\\}:[0-9]\\{0,2\\}.[0-9]\\{0,3\\}" . 'salesforce-log-timestamp-face)
          ("\\[\\([0-9]+\\)\\]" . (1 'salesforce-log-line-face)))))



(define-derived-mode apex-log-mode fundamental-mode "apex-log"
  "Major mode for log salesforce."

  (setq font-lock-defaults '((salesforce-font-lock))))

(provide 'apex-log-mode)
#+end_src
* ORG BABEL APEX LOG
#+begin_src emacs-lisp :tangle ./ob-apex-log.el
;;; ob-template.el --- org-babel functions for template evaluation

;; Copyright (C) your name here

;; Author: tan.nguyen@furucrm.com
;; Keywords: literate programming, reproducible research
;; Homepage: https://orgmode.org
;; Version: 0.01

;;; License:

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation; either version 3, or (at your option)
;; any later version.
;;
;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.
;;
;; You should have received a copy of the GNU General Public License
;; along with GNU Emacs; see the file COPYING.  If not, write to the
;; Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor,
;; Boston, MA 02110-1301, USA.

;;; Commentary:

;; This file is not intended to ever be loaded by org-babel, rather it is a
;; template for use in adding new language support to Org-babel. Good first
;; steps are to copy this file to a file named by the language you are adding,
;; and then use `query-replace' to replace all strings of "template" in this
;; file with the name of your new language.

;; After the `query-replace' step, it is recommended to load the file and
;; register it to org-babel either via the customize menu, or by evaluating the
;; line: (add-to-list 'org-babel-load-languages '(template . t)) where
;; `template' should have been replaced by the name of the language you are
;; implementing (note that this applies to all occurrences of 'template' in this
;; file).

;; After that continue by creating a simple code block that looks like e.g.
;;
;; #+begin_src template

;; test

;; #+end_src

;; Finally you can use `edebug' to instrumentalize
;; `org-babel-expand-body:template' and continue to evaluate the code block. You
;; try to add header keywords and change the body of the code block and
;; reevaluate the code block to observe how things get handled.

;;
;; If you have questions as to any of the portions of the file defined
;; below please look to existing language support for guidance.
;;
;; If you are planning on adding a language to org-babel we would ask
;; that if possible you fill out the FSF copyright assignment form
;; available at https://orgmode.org/request-assign-future.txt as this
;; will make it possible to include your language support in the core
;; of Org-mode, otherwise unassigned language support files can still
;; be included in the contrib/ directory of the Org-mode repository.


;;; Requirements:

;; Use this section to list the requirements of this language.  Most
;; languages will require that at least the language be installed on
;; the user's system, and the Emacs major mode relevant to the
;; language be installed as well.

;;; Code:
(require 'ob)
(require 'ob-ref)
(require 'ob-comint)
(require 'ob-eval)
(require 'salesforce-minor-mode)
;; possibly require modes required for your language
#+end_src

** Dependencies
#+begin_src emacs-lisp :tangle ./ob-apex-log.el
;; optionally define a file extension for this language
(add-to-list 'org-babel-tangle-lang-exts '("log" . "apex-log"))
#+end_src

** Define Headers
#+begin_src emacs-lisp :tangle ./ob-apex-log.el
;; optionally declare default header arguments for this language
(defvar org-babel-default-header-args:apex-log '((:class-test . "")
                                                 (:org . "")
                                                 (:log-id . "")
                                                 (:number . "1")
                                                 (:filter-type . "")
                                                 (:filter-value . "")))

(defvar org-babel-default-inline-header-args:apex-log '((:org . "")
                                                        (:log-id . "")
                                                        (:class-test . "")
                                                        (:number . "1")
                                                        (:filter-type . "")
                                                        (:filter-value . "")))
#+end_src

** Expand Body Apex Log
#+begin_src emacs-lisp :tangle ./ob-apex-log.el
;; This function expands the body of a source code block by doing things like
;; prepending argument definitions to the body, it should be called by the
;; `org-babel-execute:template' function below. Variables get concatenated in
;; the `mapconcat' form, therefore to change the formatting you can edit the
;; `format' form.
(defun org-babel-expand-body:apex-log (body params &optional processed-params)
  "Expand BODY according to PARAMS, return the expanded body."
  (require 'inf-template nil t)
  (let ((vars (org-babel--get-vars (or processed-params (org-babel-process-params params)))))
    (concat
     (mapconcat ;; define any variables
      (lambda (pair)
        (format "%s=%S"
                (car pair) (org-babel-template-var-to-template (cdr pair))))
      vars "\n")
     "\n" body "\n")))
#+end_src


