apex-log-mode.org
** Execute Apex Log
#+begin_src emacs-lisp :tangle ./ob-apex-log.el
;; This is the main function which is called to evaluate a code
;; block.
;;
;; This function will evaluate the body of the source code and
;; return the results as emacs-lisp depending on the value of the
;; :results header argument
;; - output means that the output to STDOUT will be captured and
;;   returned
;; - value means that the value of the last statement in the
;;   source code block will be returned
;;
;; The most common first step in this function is the expansion of the
;; PARAMS argument using `org-babel-process-params'.
;;
;; Please feel free to not implement options which aren't appropriate
;; for your language (e.g. not all languages support interactive
;; "session" evaluation).  Also you are free to define any new header
;; arguments which you feel may be useful -- all header arguments
;; specified by the user will be available in the PARAMS variable.
(defun org-babel-execute:apex-log (body params)
  "Execute a block of Template code with org-babel.
This function is called by `org-babel-execute-src-block'"
  (message "executing Template source code block")
  (let* ((processed-params (org-babel-process-params params))
         ;; set the session if the value of the session keyword is not the
         ;; string `none'
         ;; (session (unless (string= value "none")
         ;;           (org-babel-template-initiate-session
         ;;            (cdr (assq :session processed-params)))))
         ;; variables assigned for use in the block
         (vars (org-babel--get-vars processed-params))
         (result-params (assq :result-params processed-params))
         ;; either OUTPUT or VALUE which should behave as described above
         (result-type (assq :result-type processed-params))
         ;; expand the body with `org-babel-expand-body:template'
         (full-body (org-babel-expand-body:apex-log
                     body params processed-params)))

     ;; (if (null (assq :test-class processed-params))
     (ob-apex-log:filter-log processed-params)))
     ;; (ob-apex-log:get-log-test-class processed-params)))
    ;; actually execute the source-code block either in a session or
    ;; possibly by dropping it to a temporary file and evaluating the
    ;; file.
    ;;
    ;; for session based evaluation the functions defined in
    ;; `org-babel-comint' will probably be helpful.
    ;;
    ;; for external evaluation the functions defined in
    ;; `org-babel-eval' will probably be helpful.
    ;;
    ;; when forming a shell command, or a fragment of code in some
    ;; other language, please preprocess any file names involved with
    ;; the function `org-babel-process-file-name'. (See the way that
    ;; function is used in the language files)

#+end_src
** Run test class
#+begin_src emacs-lisp :tangle ./ob-apex-log.el
(defun ob-apex-log:get-log-test-class (processed-params)
  "Get log from test class executed"
  (let* ((test-class-name (cdr (assq :test-class processed-params)))
         (uuid (org-id-uuid))
         (command (sfmm--helper:generate-command (list sfmm:apex-command-alias "run" "test" "--tests" test-class-name "--test-level" "RunSpecifiedTests" "--json"))))

    (org-babel-remove-result)

    (re-search-forward "#\\+end_src")
    (previous-line)
    (newline)
    (insert uuid)

    (sfmm--helper:make-async-process
     :command command
     :handle-success-lambda
     `(lambda (process json-instance buffer)

        (sfmm:apex:get-log
         :number "1"
         :post-log-handle
         ,`(lambda (log-content)

              (let ((filter-type ,(cdr (assq :filter-type processed-params))))
                (unless (or (equal filter-type "none")
                            (null filter-type))
                  (let ((debug-keywords '("DEBUG"))
                        (executable-keywords '("VARIABLE_ASSIGNMENT"
                                               "STATEMENT_EXECUTE"
                                               "METHOD_ENTRY"
                                               "CONSTRUCTOR_EXIT"
                                               "CODE_UNIT_STARTED"))
                        (system-keywords '("VARIABLE_SCOPE_BEGIN"
                                           "USER_INFO"
                                           "EXECUTION_STARTED"
                                           "CODE_UNIT_STARTED"
                                           "HEAP_ALLOCATE"
                                           "STATEMENT_EXECUTE"
                                           "METHOD_ENTRY"))
                        (groverment-keywords '("LIMIT_USAGE_FOR_NS"
                                               "Number of"
                                               "Maximum CPU"
                                               "Maximum heap")))

                   (setq log-content
                         (mapconcat (lambda (line)
                                      (cond ((and (equal filter-type "DEBUG")
                                                  (string-match (regexp-opt debug-keywords) line))

                                             (concat line "\n"))
                                            ((and (equal filter-type "FILTER")
                                                  (search ,(cdr (assq :filter-value processed-params)) line))
                                             (concat line "\n"))
                                            ((and (equal filter-type "EXECUTABLE")
                                                  (string-match (regexp-opt executable-keywords) line))
                                             (concat line "\n"))
                                            ((and (equal filter-type "SYSTEM")
                                                  (string-match (regexp-opt system-keywords) line))

                                             (concat line "\n"))
                                            ((and (eq filter-type "GOVERNMENT")
                                                  (match-string (regexp-opt groverment-keywords) line))
                                             (concat line "\n"))))
                                  (split-string log-content "\n"
                                    "")))))

               (with-current-buffer (find-file ,(buffer-file-name))
                 (beginning-of-buffer)
                 (re-search-forward ,uuid)
                 (forward-line -1)
                 (newline)
                 (insert (concat "|-------------------LOG--------------------------|"
                                  "\n" log-content))
                 (next-line)
                 (delete-line)

                 (alert "get log success"
                        :title "Salesforce Alert")))))))))
#+end_src

