apex-ts-log/ob-apex-log.el
  "Filter match string in log"
  (let* ((uuid (org-id-uuid))
         (log-id (format "%s" (cdr (assq :log-id processed-params))))
         (org (format "%s" (cdr (assq :org processed-params))))
         (number (format "%s" (cdr (assq :number processed-params))))
         (buffer (current-buffer)))

         ;; (filterd-content (mapconcat
         ;;                   (lambda (line)
         ;;                     (when (string-match-p keyword line)
         ;;                       line))
         ;;                   (split-string log-content "\n")
         ;;                   "\n")))
   (org-babel-remove-result)


   (insert uuid)

   (sfmm:apex:get-log
     :log-id log-id
     :number number
     :org org
     :post-log-handle
     `(lambda (log-content)
        (let* ((filter-type ,(upcase (format "%s" (cdr (assq :filter-type processed-params)))))
               (filter-value ,(format "%s" (cdr (assq :filter-value processed-params))))
               (debug-keywords '("DEBUG"))
               (executable-keywords '("VARIABLE_ASSIGNMENT"
                                      "STATEMENT_EXECUTE"
                                      "METHOD_ENTRY"
                                      "CONSTRUCTOR_EXIT"
                                      "CODE_UNIT_STARTED"))
               (system-keywords '("VARIABLE_SCOPE_BEGIN"
                                  "USER_INFO"
                                  "EXECUTION_STARTED"
                                  "CODE_UNIT_STARTED"
                                  "HEAP_ALLOCATE"
                                  "STATEMENT_EXECUTE"
                                  "METHOD_ENTRY"))
               (groverment-keywords '("LIMIT_USAGE_FOR_NS"
                                      "Number of"
                                      "Maximum CPU"
                                      "Maximum heap"))
               (content (cond ((= filter-type "")
                               log-content)
                              (t
                                (mapconcat (lambda (line)

                                             (cond ((and (string= filter-type "DEBUG")
                                                         (string-match (regexp-opt debug-keywords) line))

                                                    (concat line "\n"))
                                                   ((and (equal filter-type "FILTER")
                                                         (search filter-value line))
                                                    (concat line "\n"))
                                                   ((and (equal filter-type "EXECUTABLE")
                                                        (string-match (regexp-opt executable-keywords) line))
                                                    (concat line "\n"))
                                                   ((and (equal filter-type "SYSTEM")
                                                         (string-match (regexp-opt system-keywords) line))
                                                    (concat line "\n"))
                                                   ((and (eq filter-type "GOVERNMENT")
                                                         (match-string (regexp-opt groverment-keywords) line))
                                                    (concat line "\n"))))
                                           (split-string log-content "\n")
                                           ""))))))

        (with-current-buffer ,buffer
          (beginning-of-buffer)
          (re-search-forward ,uuid)
          (forward-line -1)
          (newline)
          (insert (concat "|-------------------LOG--------------------------|"
                   "\n" log-content))
          (next-line)
          (delete-line)

          (alert "get log success"
                 :title "Salesforce Alert"))))))



;; This function should be used to assign any variables in params in
;; the context of the session environment.
(defun org-babel-prep-session:apex-log (session params)
  "Prepare SESSION according to the header arguments specified in PARAMS.")


(defun org-babel-template-var-to-template (var)
  "Convert an elisp var into a string of template source code
specifying a var of the same value."
  (format "%S" var))

(defun org-babel-template-table-or-string (results)
  "If the results look like a table, then convert them into an
Emacs-lisp table, otherwise return the results as a string.")


(defun org-babel-template-initiate-session (&optional session)
  "If there is not a current inferior-process-buffer in SESSION then create.
Return the initialized session."
  (unless (string= session "none")))


(provide 'ob-apex-log)
;;; ob-template.el ends here
